[{"created": "2020-08-14 14:15:10", "text": "Tesla CEO Elon Musk tweeted Friday that two-factor authentication for its app is \"embarrassingly late\" but apparently is now on the way. Musk didn't provide a timeline, but said on Twitter that two-factor authentication - which adds an additional step to verify a user's identity at sign-in - is in final validation. ", "title": "Musk says Tesla two-factor authentication \"embarrassingly late\" but coming soon", "link": 1}, {"created": "2020-08-16 13:15:45", "title": "Twitter 'looking' at a possible TikTok tie-up", "text": "Twitter has approached TikTok's Chinese owner ByteDance to express an interest in buying its US operations, according to reports.\r\n\r\nVideo-sharing platform TikTok has been at the centre of fierce debate in recent weeks and takeover talk.\r\n\r\nLast week US Donald Trump ordered firms to stop doing business with TikTok within 45 days over security concerns.\r\n\r\nTech giant Microsoft is the front-runner to buy TikTok but now Twitter has emerged as a possible suitor.\r\n\r\nBut it remains unclear whether Twitter can afford to buy TikTok from its Chinese owners and can complete a deal within the 45-day window, according to sources quoted in the Wall Street Journal.\r\n\r\nThe value of TikTok's US operations are unclear but estimates put it at tens of billions of dollars.\r\n\r\nTwitter's market capitalisation is about $29bn (£22bn), dwarfed by Microsoft's at more than $1.6tn.\r\n\r\nBut experts believe a possible Twitter deal would face less regulatory scrutiny than Microsoft's.\r\n\r\nA Twitter spokesman declined to comment on a possible deal while TikTok didn't respond immediately when contacted by the BBC.", "link": 64864}, {"created": "2020-08-13 14:59:10", "text": "Apple has removed Epic Games' battle royale game Fortnite from the App Store after the developer on Thursday implemented its own in-app payment system that bypassed Apple's standard 30 percent fee\n\nThe decision marks a significant escalation in the feud between Epic and one of the world's most dominant mobile software marketplaces. It also comes at an especially fraught time for Apple as the iPhone maker navigates antitrust concerns over its operation of the App Store and the rules it imposes on certain developers.", "title": "Apple just kicked Fortnite off the App Store", "link": 2}, {"created": "2020-08-16 13:27:17", "title": "Fortnite banned by Apple and Android app stores over in-app purchases dispute", "text": "Android have followed Apple in banning Fortnite from its Google Play Store.\r\n\r\nFortnite is a Battle Royale shooter where multiple players drop in to an ever-shrinking map fighting it out to be the last one standing.\r\n\r\nIt's a popular game mode that has been replicated by many, most notably by Activision who have seen success with their release of Call of Duty: Warzone, part of the 2019 title, Call of Duty: Modern Warfare, developed by Infinity War and Raven Software.\r\n\r\nhe drastic move from Android comes after Apple also banned the mobile version from its App Store, restricting players from installing the world's most popular gaming franchise.\r\n\r\nThe ban followed a Fortnite update that allows players to make in-game purchases directly from maker Epic Games - bypassing the 30% cut of sales taken by both Apple and Android for in-app purchases.", "link": 91368}]
